app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "important") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "This is new"], ["body", "this is the body "], ["created_at", "2022-09-09 14:19:03.010299"], ["updated_at", "2022-09-09 14:19:03.010299"], ["status", "public"], ["important", false]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = $1, "important" = $2 WHERE "articles"."id" = $3  [["updated_at", "2022-09-09 12:57:01.140959"], ["important", true], ["id", 2]]